#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2025z-318384/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025z-318384/global/networks/main-vpc]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2025z-318384"/regions/"europe-west1"/zones/<null>]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2025z-318384/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025z-318384/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025z-318384/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025z-318384/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025z-318384/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2025z-318384/dataproc.googleapis.com]
module.dataproc.google_service_account.dataproc_sa: Refreshing state... [id=projects/tbd-2025z-318384/serviceAccounts/tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket.dataproc_temp: Refreshing state... [id=tbd-2025z-318384-dataproc-temp]
module.dataproc.google_storage_bucket.dataproc_staging: Refreshing state... [id=tbd-2025z-318384-dataproc-staging]
module.dataproc.google_project_iam_member.dataproc_worker: Refreshing state... [id=tbd-2025z-318384/roles/dataproc.worker/serviceAccount:tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor: Refreshing state... [id=tbd-2025z-318384/roles/bigquery.dataEditor/serviceAccount:tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_user: Refreshing state... [id=tbd-2025z-318384/roles/bigquery.user/serviceAccount:tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam: Refreshing state... [id=b/tbd-2025z-318384-dataproc-staging/roles/storage.objectAdmin/serviceAccount:tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam: Refreshing state... [id=b/tbd-2025z-318384-dataproc-temp/roles/storage.objectAdmin/serviceAccount:tbd-2025z-318384-dataproc-sa@tbd-2025z-318384.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2025z-318384/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/clusters/tbd-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ effective_labels              = {
          - "goog-dataproc-autozone"          = "enabled"
          - "goog-dataproc-cluster-name"      = "tbd-cluster"
          - "goog-dataproc-cluster-uuid"      = "9037e2c2-9c4a-4712-bfd9-89ae72155a81"
          - "goog-dataproc-drz-resource-uuid" = "cluster-9037e2c2-9c4a-4712-bfd9-89ae72155a81"
          - "goog-dataproc-location"          = "europe-west1"
        } -> (known after apply)
      ~ id                            = "projects/tbd-2025z-318384/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      - labels                        = {} -> null
        name                          = "tbd-cluster"
      ~ terraform_labels              = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket         = "tbd-2025z-318384-dataproc-staging" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ auxiliary_node_groups (known after apply)

          ~ dataproc_metric_config (known after apply)

          ~ endpoint_config {
              ~ http_ports              = {
                  - "HDFS NameNode"             = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/hdfs/dfshealth.html"
                  - "Jupyter"                   = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/gateway/default/jupyter/"
                  - "JupyterLab"                = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/gateway/default/jupyter/lab/"
                  - "MapReduce Job History"     = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/jobhistory/"
                  - "Spark History Server"      = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/sparkhistory/"
                  - "Tez"                       = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/apphistory/tez-ui/"
                  - "YARN Application Timeline" = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/apphistory/"
                  - "YARN ResourceManager"      = "https://i6at2vwjhzdojmgncq6h44wipi-dot-europe-west1.dataproc.googleusercontent.com/yarn/"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ gce_cluster_config {
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud.useraccounts.readonly",
                  - "https://www.googleapis.com/auth/devstorage.read_write",
                  - "https://www.googleapis.com/auth/logging.write",
                    # (1 unchanged element hidden)
                ]
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-318384/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2025z-318384/regions/europe-west1/subnetworks/subnet-01"
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-b" -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ node_group_affinity (known after apply)

              ~ reservation_affinity (known after apply)

              ~ shielded_instance_config (known after apply)
              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = true -> null
                  - enable_vtpm                 = true -> null
                }
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-2-ubu22-20251016-165100-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ machine_type     = "e2-standard-2" -> "e2-standard-4" # forces replacement
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

          ~ preemptible_worker_config (known after apply)
          - preemptible_worker_config {
              - instance_names = [] -> null
              - num_instances  = 0 -> null
                # (1 unchanged attribute hidden)

              - disk_config {}

              - instance_flexibility_policy {
                  - instance_selection_results = [] -> null
                }
            }

          ~ software_config {
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.resource-calculator"                          = "org.apache.hadoop.yarn.util.resource.DominantResourceCalculator"
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"                 = "fair"
                  - "core:fs.gs.block.size"                                                                   = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                                        = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                                       = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                                          = "-Xmx576m"
                  - "distcp:mapreduce.map.memory.mb"                                                          = "768"
                  - "distcp:mapreduce.reduce.java.opts"                                                       = "-Xmx576m"
                  - "distcp:mapreduce.reduce.memory.mb"                                                       = "768"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                                         = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                               = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                                          = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                                         = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                                           = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                                         = "20"
                  - "hdfs:dfs.namenode.http-address"                                                          = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                                         = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                                  = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                                = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                               = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                                 = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                                    = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                                            = "2048"
                  - "mapred:mapreduce.job.maps"                                                               = "9"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                                     = "0.95"
                  - "mapred:mapreduce.job.reduces"                                                            = "3"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                                        = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                                         = "1"
                  - "mapred:mapreduce.map.java.opts"                                                          = "-Xmx2621m"
                  - "mapred:mapreduce.map.memory.mb"                                                          = "3277"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                                      = "1"
                  - "mapred:mapreduce.reduce.java.opts"                                                       = "-Xmx2621m"
                  - "mapred:mapreduce.reduce.memory.mb"                                                       = "3277"
                  - "mapred:mapreduce.task.io.sort.mb"                                                        = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                               = "-Xmx2621m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                                        = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                                = "3277"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                                           = "2048m"
                  - "spark:spark.driver.maxResultSize"                                                        = "1024m"
                  - "spark:spark.driver.memory"                                                               = "2048m"
                  - "spark:spark.executor.cores"                                                              = "1"
                  - "spark:spark.executor.instances"                                                          = "2"
                  - "spark:spark.executor.memory"                                                             = "2893m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                                            = "1"
                  - "spark:spark.plugins.defaultList"                                                         = "com.google.cloud.dataproc.DataprocSparkPlugin"
                  - "spark:spark.scheduler.mode"                                                              = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                                             = "true"
                  - "spark:spark.sql.optimizer.runtime.bloomFilter.join.pattern.enabled"                      = "true"
                  - "spark:spark.ui.port"                                                                     = "0"
                  - "spark:spark.yarn.am.memory"                                                              = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                                      = "819"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                                  = "2048"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                                   = "2048"
                  - "yarn:yarn.nodemanager.address"                                                           = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                               = "2"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                                = "6554"
                  - "yarn:yarn.resourcemanager.decommissioning-nodes-watcher.decommission-if-no-shuffle-data" = "true"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs"                = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                               = "6554"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                               = "1"
                } -> (known after apply)
                # (2 unchanged attributes hidden)
            }

          ~ worker_config {
              ~ image_uri         = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-2-ubu22-20251016-165100-rc01" -> (known after apply)
              ~ instance_names    = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ machine_type      = "e2-standard-2" -> "e2-standard-4" # forces replacement
              ~ min_cpu_platform  = "AUTOMATIC" -> (known after apply)
              ~ min_num_instances = 0 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ virtual_cluster_config (known after apply)
    }

  # module.gcr.google_artifact_registry_repository.registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "registry" {
        id                     = "projects/tbd-2025z-318384/locations/europe/repositories/eu.gcr.io"
        name                   = "eu.gcr.io"
        # (13 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"ai_notebook_instance_owner" but a value was found in file
"env/project.tfvars". If you meant to use this value, add a "variable" block
to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Kutyl87, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*